/* The first %.0f is the width and the other is the height */
"%.0f x %.0f" = "%1$.0f x %2$.0f";

/* The first %.0f is the video width and the second it the height */
"%.0fx%.0f" = "%1$.0fx%2$.0f";

/* File size gigabytes */
"%.1f GB" = "%.1f GB";

/* File size kilobytes */
"%.1f KB" = "%.1f KB";

/* File size megabytes */
"%.1f MB" = "%.1f MB";

/* %@ is the date */
"%@" = "%@";

/* First %@ is video dimensions and the second is file size */
"%@ - %@" = "%1$@ - %2$@";

/* %d is the days that passed */
"%d days ago" = "%d 天前";

/* %d is the hours that passed */
"%d hours ago" = "%d 小时前";

/* The first %d is hours, next is minutes and the last is seconds */
"%d hr %d min %d sec" = "%1$d 小时 %2$d 分钟 %3$d 秒";

/* The first %d is minutes and the last is seconds */
"%d min %d sec" = "%1$d 分钟 %2$d 秒";

/* %d is the minutes that passed */
"%d minutes ago" = "%d 分钟前";

/* The %d is seconds */
"%d sec" = "%d 秒";

/* Related to time */
"1 day ago" = "1天前";

/* Related to time */
"1 hour ago" = "1小时前";

/* Related to time */
"1 minute ago" = "1分钟前";

/* Time that currently past */
"just now" = "现在";

